##### quiz
```
local city_info 데이터베이스의 popular 테이블의 데이터를 가져와
ubuntu test 데이터베이스의 popular 테이블로 마이그레이션하는 코드를 작성
```

In [6]:
# read local city_info popular 

import MySQLdb, pickle
import pandas as pd
from sqlalchemy import create_engine

pw = "eoghks3885"

In [7]:
# write ubuntu test popular

db = MySQLdb.connect(
    "127.0.0.1",
    "root",
    pw,
    "city_info",
    charset = 'utf8',)

In [8]:
SQL_QUERY = """
    SELECT *
    FROM popular;
"""

In [13]:
curs = db.cursor()
count = curs.execute(SQL_QUERY)
rows = curs.fetchall()
for row in rows:
    print(row)

(1, 'Seoul', 9904312)
(2, 'Busan', 3448737)
(3, 'Incheon', 2890451)
(4, 'Daegu', 2466052)
(5, 'Daejeon', 1538394)
(6, 'gwanggju', 1502881)

In [14]:
SQL_QUERY_2 = """
    INSERT INTO popular(rank, city_name, popular)
    VALUES(6, "gwanggju", 1502881)
"""

In [15]:
curs = db.cursor()
count = curs.execute(SQL_QUERY_2)
db.commit()

In [16]:
city_df = pd.read_sql(SQL_QUERY, db)
city_df

   rank city_name  popular
0     1     Seoul  9904312
1     2     Busan  3448737
2     3   Incheon  2890451
3     4     Daegu  2466052
4     5   Daejeon  1538394
5     6  gwanggju  1502881
6     6  gwanggju  1502881

In [20]:
engine = create_engine("mysql+mysqldb://root:" + pw + "@52.78.171.247/test")
city_df.to_sql(name = "city_info", con = engine, if_exists = 'replace')